// 练习指向二维数组的指针（指向行和指向列的指针）

#include <stdio.h>
int main()
{
    int arr[3][4] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12};
    for (int i = 0; i < 3; i++)
    {
        for (int j = 0; j < 4; j++)
        {
            printf("%10d", &arr[i][j]);
        }
        printf("\n");
    }
    printf("-------\n");

    //指向行的指针
    printf("arr为指向第1行指针: %d\n", arr);           // arr为指向第1行指针
    printf("arr+1为指向第2行的指针: %d\n", arr + 1);   // arr+1为指向第2行的指针
    printf("&arr[2]为指向第3行的指针: %d\n", &arr[2]); // &arr[2]为指向第3行的指针

    printf("-------\n");
    //指向列的指针
    printf("arr[0]为指向第1行第1列的指针: %d\n", arr[0]);             // arr[0]为指向第1行第1列的指针
    printf("arr[1]+1为指向第2行第2列的指针: %d\n", arr[1] + 1);       // arr[1]+1为指向第2行第2列的指针
    printf("*arr为指向第1行第1列的指针: %d\n", *arr);                 // *arr为指向第1行第1列的指针
    printf("*(arr+1)为指向第2行第1列的指针: %d\n", *(arr + 1));       // *(arr+1)为指向第2行第1列的指针
    printf("*arr+1为指向第1行第2列的指针: %d\n", *arr + 1);           // *arr+1为指向第1行第2列的指针
    printf("*(arr+1)+1为指向第2行第2列的指针: %d\n", *(arr + 1) + 1); // *(arr+1)+1为指向第2行第2列的指针
    printf("&a[2][2]为指向第3行第3列的指针: %d\n", &arr[2][2]);       // &a[2][2]为指向第3行第3列的指针

    printf("-------\n");
    // 指向值
    printf("arr[1][1]为指向第2行第2列的值: %d\n", arr[1][1]);            // arr[1][1]为指向第2行第2列的值
    printf("*(arr[1]+1)为指向第2行第2列的值: %d\n", *(arr[1] + 1));      // *(arr[1]+1)为指向第2行第2列的值
    printf("*(*(arr+1)+1为指向第2行第2列的值: %d\n", *(*(arr + 1) + 1)); // *(*(arr+1)+1为指向第2行第2列的值
}