// 使用字符指针变量和字符数组的比较

#include <stdio.h>
int main()
{
    /* 1. 存放内容
        字符数组：有若干个元素组成，每个元素中存放一个字符
        字符指针变量：存放的是地址（字符串中的第1个字符的地址）
     */

    /* 2.赋值方式
        字符数组：
            （本身）不可以对数组名赋值
            （内部）可以对字符数组内部元素赋值
        字符指针变量：
            （本身）可以对字符指针变量赋值或更改
            （内部）若赋值为字符串常量，不可再对内部字符串常量中的内容更改赋值
                   若赋值为字符数组，可以再对内部字符数组中的内容更改赋值
     */
    char str1[14];
    // str1 = "I am student" 错，字符数组名是地址，常量，不能被赋值
    str1[0] = 'A';
    char *p1;
    p1 = "I am student";

    /* 3.初始化含义
        字符数组：定义字符数组，并把字符串赋给数组中各个元素（仅在定义时可以全部元素整体赋值）
        字符指针变量：定义字符指针变量，并把字符串第一个元素的地址赋给字符指针变量
     */
    char str2[10] = "hello"; // 不等价于 char str2[10]; str2[]="hello"; 错
    char *p2 = "hello";      // 等价于 char *p2; p2 = "hello"; 对

    /* 4.存储单元的内容
        字符数组：编译时为字符数组分配若干存储单元，来存放各元素的值
        字符指针变量：分配一个存储单元，指针变量此时已经指向了一个不可预料位置的内存单元地址，
                    因此需要及时赋值为自己定义的新地址，防止错误
     */
    //char *p3;
    //scanf("%s",p3); 这里会有警告，指针变量a未及时赋值新的未使用的内存地址，直接指向该字符串，可能会错误

    /* 5.引用
        字符数组：
            下标法str[5]和地址法*(str+5)
        字符指针变量：
            指向字符数组：下标法p[5]和地址法*(p+5)
            指向字符串常量：下标法p[5]和地址法*(p+5)也都可以
     */
    char str3[10] = "nihao";
    printf("%c %c\n", str3[3], *(str3 + 3));
    char *p3 = str3;
    *(p3 + 3) = 'A';
    printf("%s %c %c\n", p3, p3[3], *(p3 + 3));
    p3 = "goodafternoon";
    printf("%s %c %c\n", p3, p3[3], *(p3 + 3));

    /* 6.格式字符串（可变格式函数）
        字符数组：只能采用定义数组初始化或逐个对元素赋值方法
        字符指针变量：字符指针变量指向的字符串就可改变输入输出格式
     */
    int a = 10, b = 11;
    char format1[] = "a=%d,b=%d\n";
    printf(format1,a,b);
    char *format2;
    format2 = "a=%d,b=%d\n";
    printf(format2,a,b);
    format2 = "a=%0x,b=%0x\n";
    printf(format2,a,b);
}