// 指向指针数据的指针（用指向指针数据的指针变量输出整形数组各元素的值）

#include <stdio.h>
int main()
{
    int a[5] = {1, 3, 5, 7, 9}; // 定义一个整型数组
    int *num[5];                // 定义一个指针数组
    int **p;                    // 定义一个指向指针数据的指针
    p = num;                    // 指向指针的指针指向指针数组首元素地址
    for (int i = 0; i < 5; i++)
    {
        //num[i]=&a[i];  // 下标法将整形数据各元素地址赋给指针数组
        num[i] = a + i; // 指针法将整形数据各元素地址赋给指针数组，前面指针数组此时还未赋值，各指针元素指向地址未知，故只能用下标
        printf("%d ", num[i]);
    }
    printf("\n");
    for (int i = 0; i < 5; i++)
    {
        printf("%d ", *p); // 指向整形数组各元素的地址
        p++;
    }
    printf("\n");
    p = num;
    for (int i = 0; i < 5; i++)
    {
        printf("%d ", **p); // 二级间址寻找输出整形数组值
        p++;
    }
    printf("\n");

    // 纯指针法：
    for (p = num; p < num + 5; p++)
    {
        printf("%d ", **p); // 二级间址寻找输出整形数组值
    }
    return 0;
}